app/Models/PacientesModel.php

  public function get($search = null, $export = false)
  {
    $db = \Config\Database::connect();
    $query = $db->table($this->table);

    $result['total']['geral'] = $query->countAllResults(false);

    if ($search) {
      $dataFormat = $this->dateFormat($search);
      $phoneFormat = $this->phoneFormat($search);
      $filterSex = $this->filterSex($search);

      $query->groupStart()
        ->like('id', $search, 'both')
        ->orLike('nome', $search, 'both')
        ->orLike('data_nascimento', $dataFormat, 'both')
        ->orLike('sexo', $filterSex, 'both')
        ->orLike('endereco', $search, 'both')
        ->orLike('telefone', $phoneFormat, 'both')
        ->groupEnd();
    }

    $result['total']['filtrado'] = $query->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `cad_pacientes`